[
  [
    "Timestamp",
    "Name",
    "School Id",
    "Title",
    "Video link",
    "Summary",
    "Github final project link",
    "Honor code declaration"
  ],
  [
    "2025-06-03T16:54:05.649Z",
    "(100) 張竣淳",
    "411273100",
    "台灣108年人口識字狀況深度分析：不識字率、性別與區域差異的數據洞察",
    "https://youtu.be/TvRXxR6LRxU?si=mr-Qf9SjVMNCAYYm",
    "本報告對民國108年（西元2019年）台灣15歲以上人口的識字狀況進行了全面而深入的數據分析。透過對多個維度（包括整體分佈、性別差異、區域特性以及識字率與識字人數的綜合考量）的探討，我們得以描繪出台灣在教育普及方面的現況、成就與仍需關注的挑戰。\n\n首先，從不識字率的整體密度分佈來看，台灣展現了顯著的教育普及成果。數據呈現高度右偏態，絕大多數地區與性別群體的不識字率集中在0.5%至2.0%的低百分比區間。這強烈印證了國民普遍具備基礎讀寫能力，凸顯了台灣在義務教育推廣與成人教育普及上的成功。然而，分佈曲線右側的長尾也提醒我們，仍有少數群體的不識字率相對較高，這為未來的精準教育干預提供了方向。\n\n其次，性別差異在不識字率數據中是一個普遍且顯著的特徵。分析顯示，女性的平均不識字率（1.87%）明顯高於男性（0.20%）。這種現象並非台灣獨有，而是全球許多社會在歷史發展中因傳統社會觀念、教育機會受限等因素所導致的普遍現象。儘管現代社會教育機會已大幅改善且強調性別平等，此數據仍反映了歷史遺留的代際效應。這提醒我們，即使在高度識字的社會中，仍需持續關注並推動全民識字教育，尤其要針對那些可能因歷史或社會結構因素而未能充分獲得教育機會的女性群體。\n\n在區域分析方面，我們同時考量了不識字率與不識字人數的絕對量。散佈圖揭示了人口規模與不識字率之間的負相關趨勢：人口規模較大、城市化程度高的六都，其不識字率普遍較低。這證明了都會區完善的教育基礎設施和資源對識字率的正面影響。然而，若從不識字人數的絕對量來看，人口總量龐大的都會區（如新北市、高雄市、臺中市）即使不識字率較低，其不識字人數的絕對量仍然是最大的。這表明都市地區亦存在大量需要識字教育幫助的群體，這部分可能包含了年長者或新移民。相對地，部分偏遠縣市儘管人口基數小導致不識字人數較少，但其不識字率可能相對較高，這提示這些地區可能面臨教育資源分佈不均、人口老化等結構性挑戰。\n\n最後，對不識字率區域分佈與性別差異的分面長條圖分析，提供了最為細緻的洞察。該圖明確指出，女性不識字率普遍高於男性的模式在台灣幾乎所有區域均一致，但這種性別差異的「程度」在不同區域間存在微妙變化。在某些南部或農業縣市，性別不識字率差異顯著較大，暗示這些地區可能存在較深的性別教育鴻溝；而在都會區，儘管女性不識字率仍略高，但兩者差距明顯縮小。這為制定更具針對性的教育干預策略提供了精準依據，強調了應根據不同區域的具體情況，特別針對女性（尤其是年長女性）提供成人識字課程和社區推廣活動，以促進教育公平。\n\n總體而言，台灣在全民識字方面取得了巨大成就，識字率普遍極高。然而，數據分析也清晰揭示了隱藏在這些高成就背後的性別與區域差異。未來的教育政策與資源分配應從多維度出發，既要持續鞏固整體識字水平，也要精準解決特定群體和區域所面臨的挑戰，確保每一個公民，無論其性別或居住地，都能享有平等的學習機會，共同建設一個更加知識型、包容且公平的社會。",
    "https://github.com/jimchang0910/113-2-R-final-project",
    [
      "I agree."
    ]
  ],
  [
    "2025-06-04T14:12:55.044Z",
    "(075) 陳品淳",
    "411373075",
    "程式設計作業",
    "https://youtu.be/YcDgjpw1zsM",
    "",
    "https://github.com/pin787/113-2-R-final-project",
    [
      "I agree."
    ]
  ],
  [
    "2025-06-04T14:13:28.437Z",
    "(071) 楊紫涵",
    "411373071",
    "113 2 R final project 411373071 經濟一 楊紫涵",
    "https://youtu.be/PCNZqhDLOA4",
    "本報告透過R語言與tidyverse套件，分析新北市各區2025年人口統計資料，包含總人口與男女比例並以圖表方式呈現。",
    "https://github.com/Yang-221/113-2-R-final-project",
    [
      "I agree."
    ]
  ],
  [
    "2025-06-05T10:26:16.697Z",
    "(182) Axel AUVIGNE",
    "411079182",
    "data analysis On gen-z aspiration carrier ( in India)",
    "https://youtu.be/18U26vokguY?si=LIyaIGWi5ARfrRii",
    "Hi Sir here is my project on a dataset about gen-z aspiration carreer in India, I tried to analyse different topics, how gender can influence job aspiration, managment style preference, learning method preference? I also took a look on how different job categories prefer, remote job or on job office, and also what influences the willingness about gen-z to work long term or not in the same company. ( These are only the subject I analyzed in the 6min video however I let you my complete work on  googlecollab causeis the video I could only talk about the more interesting topics )\n\nHope you will appriciate it!",
    "https://github.com/axelauvigne/113-2-R-final-project",
    [
      "I agree."
    ]
  ],
  [
    "2025-06-05T17:04:57.895Z",
    "(141) 曹芳芳",
    "411373141",
    "新北市政府警察局歷年組織編制暨警力員額統計",
    "https://youtu.be/iDG7rxZ2o-U?si=IQZJ7J-b85BM8rUW",
    "",
    "https://github.com/caofangfang12/113-2-R-final-project",
    [
      "I agree."
    ]
  ],
  [
    "2025-06-06T05:13:32.536Z",
    "(072) 鄭捷璘",
    "411373072",
    "113年度A1交通事故資料",
    "https://youtu.be/tcXV7iRwrlg",
    "分析死亡受傷人數與保護裝備名稱的關聯",
    "https://github.com/Jielin15/113-2-R-final-project",
    [
      "I agree."
    ]
  ],
  [
    "2025-06-06T11:13:40.372Z",
    "(013) 賴郁蓉",
    "411373013",
    "113 2 R final project Posit Cloud Google Chrome 2025 06 06 18 54 20",
    "https://youtu.be/6yRV92PVQIA",
    "",
    "https://github.com/laiiiiiiiiii795/113-2-R-final-project",
    [
      "I agree."
    ]
  ]
]